SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
  // 3. 알람 시간 설정 ( 사용자 입력으로 변경 )
  USART_Config();
  uint8_t hours, minutes, seconds;
  char time_buffer[9]; // HH:MM:SS

  // 시간 입력 받기 (제대로 된 입력이 아닐 시 다시 입력 받도록 수정)
  while (1)
  {
    USART_SendString("알람 시각을 설정하세요 (HH:MM:SS)\r\n");
    USART_ReceiveString(time_buffer, 9);
    USART_SendString("\r\n");

    // 검증
    if (is_valid_time_format(time_buffer))
    {
      hours = (time_buffer[0] - '0') * 10 + (time_buffer[1] - '0');
      minutes = (time_buffer[3] - '0') * 10 + (time_buffer[4] - '0');
      seconds = (time_buffer[6] - '0') * 10 + (time_buffer[7] - '0');
      break;
    }

    USART_SendString("\r\n잘못된 시간 형식 또는 범위입니다. 다시 입력해주세요.\r\n");
  }

  RTC_AlarmTypeDef alarm;
  alarm.RTC_AlarmTime.RTC_Hours = hours;
  alarm.RTC_AlarmTime.RTC_Minutes = minutes;
  alarm.RTC_AlarmTime.RTC_Seconds = seconds;
  alarm.RTC_AlarmMask = RTC_AlarmMask_DateWeekDay; // 날짜 무시
  alarm.RTC_AlarmDateWeekDay = 1;                  // 무시됨
  alarm.RTC_AlarmDateWeekDaySel = RTC_AlarmDateWeekDaySel_Date;

  RTC_SetAlarm(RTC_Format_BIN, RTC_Alarm_A, &alarm);

  char buf[32];
  RTC_GetTimeStr(buf, sizeof(buf));
  USART_Config();
  USART_SendString("\r\n[현재 시각] ");
  USART_SendString(buf);
  USART_SendString("\r\n");

  char alarm_time_msg[64];
  snprintf(alarm_time_msg, sizeof(alarm_time_msg), "%02d:%02d:%02d 에 알람이 울립니다...\r\n", hours, minutes, seconds);
  USART_SendString(alarm_time_msg);

  RTC_SetAlarm(RTC_Format_BIN, RTC_Alarm_A, &alarm);

  // 4. 인터럽트 설정 및 알람 켜기
  RTC_ITConfig(RTC_IT_ALRA, ENABLE);
  RTC_AlarmCmd(RTC_Alarm_A, ENABLE);

  // 5. NVIC 등록
  NVIC_EnableIRQ(RTC_Alarm_IRQn);
}

/*
*********************************************************************************************************
*                                           BUZZER FUNCTIONS
*********************************************************************************************************
*/

void Buzzer_On(void) // LOW에서 ON
{
  GPIO_ResetBits(GPIOA, GPIO_Pin_5);
}

void Buzzer_Off(void) //// HIGH에서 OFF
{
  GPIO_SetBits(GPIOA, GPIO_Pin_5);
}

/*
*********************************************************************************************************
*                                           JOYSTICK FUNCTIONS
*********************************************************************************************************
*/

// Read analog value
uint16_t JoyStick_ReadX(void)
{
  ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_15Cycles);
  ADC_SoftwareStartConv(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    ;
  return ADC_GetConversionValue(ADC1);
}

uint16_t JoyStick_ReadY(void)
{
  ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 1, ADC_SampleTime_15Cycles);
  ADC_SoftwareStartConv(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    ;
  return ADC_GetConversionValue(ADC1);
}

/*
*********************************************************************************************************
*                                           BUTTON FUNCTIONS
*********************************************************************************************************
*/

void Button_delay(uint32_t ms)
{
  for (uint32_t i = 0; i < ms * 4000; i++)
    __NOP();
}

uint8_t Button_Read(void)
{
  return GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_6);
}

/*
*********************************************************************************************************
*                                                main
*********************************************************************************************************
*/

// main()->AppTaskStart()->AppTaskCreate()

int main(void)
{
  OS_ERR err;

  /* Basic Init */
  RCC_DeInit();

  /* BSP Init */
  BSP_IntDisAll();

  CPU_Init();
  Mem_Init();
  Math_Init();

  // 현재 시간 설정
  RTC_CustomInit();
  RTC_CustomSetTime(8, 59, 50);

  // 사용자 알람 설정
  RTC_SetAlarmDaily();

  /* OS Init */
  OSInit(&err);

  OSTaskCreate((OS_TCB *)&AppTaskStartTCB,
               (CPU_CHAR *)"App Task Start",
               (OS_TASK_PTR)AppTaskStart,
               (void *)0u,
               (OS_PRIO)APP_CFG_ApptaskCreate_PRIO,
               (CPU_STK *)&AppTaskStartStk[0u],
               (CPU_STK_SIZE)AppTaskStartStk[APP_CFG_ApptaskCreate_STK_SIZE / 10u],
               (CPU_STK_SIZE)APP_CFG_ApptaskCreate_STK_SIZE,
               (OS_MSG_QTY)0u,
               (OS_TICK)0u,
               (void *)0u,
               (OS_OPT)(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
               (OS_ERR *)&err);

  OSStart(&err); /* Start multitasking (i.e. give control to uC/OS-III). */

  (void)&err;

  return (0u);
}

/*
*********************************************************************************************************
*                                           TASK FUNCTION
*********************************************************************************************************
*/

static void AppTaskStart(void *p_arg)
{
  OS_ERR err;

  (void)p_arg;

  // HW INIT
  BSP_Init();
  BSP_Tick_Init();
  Buzzer_Init();
  TouchSensor_Init();
  JoyStick_Init();
  Button_Init();
  USART_Config();

  Buzzer_Off();

  // Alarm Flag create
  OSFlagCreate(&AlarmFlagGroup, "Alarm Flag Group", (OS_FLAGS)0, &err);
  // Usart Message Queue create
  OSQCreate(&USARTMsgQ, "USART Msg Queue", 10, &err);
  // Sensor Input Queue create
  OSQCreate(&SensorInputQ, "Sensor Input Queue", 10, &err);

#if OS_CFG_STAT_TASK_EN > 0u
  OSStatTaskCPUUsageInit(&err);
#endif

#ifdef CPU_CFG_INT_DIS_MEAS_EN
  CPU_IntDisMeasMaxCurReset();
#endif

  ApptaskCreate(NULL);
}

static void ApptaskCreate(void *p_arg)
{
  OS_ERR err;
  (void)p_arg;

  // buzzer task create (PRIO 3)
  OSTaskCreate(&TCB_Buzzer,
               "Buzzer Task",
               BuzzerTask,
               0,
               BUZZER_TASK_PRIO,
               &STK_Buzzer[0],
               BUZZER_TASK_STK_SIZE / 10,
               BUZZER_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  // touch sensor task create (PRIO 4)
  OSTaskCreate(&TCB_Touch,
               "Touch Sensor Task",
               TouchSensorTask,
               0,
               TOUCH_TASK_PRIO,
               &STK_Touch[0],
               TOUCH_TASK_STK_SIZE / 10,
               TOUCH_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

