SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
  // mission task create (PRIO 5)
  OSTaskCreate(&TCB_Mission,
               "Mission Task",
               MissionTask,
               0,
               MISSION_TASK_PRIO,
               &STK_Mission[0],
               MISSION_TASK_STK_SIZE / 10,
               MISSION_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  OSTaskCreate(&TCB_Joystick,
               "Joystick Task",
               JoystickTask,
               0,
               JOYSTICK_PRIO,
               &STK_Joystick[0],
               JOYSTICK_STK_SIZE / 10,
               JOYSTICK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  // button task create(PRIO 6)
  OSTaskCreate(&TCB_Button,
               "Button Task",
               ButtonTask,
               0,
               BUTTON_TASK_PRIO,
               &STK_Button[0],
               BUTTON_TASK_STK_SIZE / 10,
               BUTTON_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  // USART task create (PRIO 7)
  OSTaskCreate(&TCB_USART,
               "USART Task",
               USARTTask,
               0,
               USART_TASK_PRIO,
               &STK_USART[0],
               USART_TASK_STK_SIZE / 10,
               USART_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);
}

// Buzzer Task
static void BuzzerTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 알람 발생까지 대기 (알람 ON 신호 올 때까지 무한대기)
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_BUZZER,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    OSFlagPend(&AlarmFlagGroup,
               ALARM_FLAG_OFF,
               0,
               OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_NON_BLOCKING,
               0,
               &err);

    // 2. 부저 울림 반복 (알람 OFF 신호 올 때까지)
    static const char msg_on[] = "\r\n알람이 울리는 중...\r\n터치 센서를 눌러 미션을 수행하세요!\r\n";
    OSQPost(&USARTMsgQ, (void *)msg_on, sizeof(msg_on), OS_OPT_POST_FIFO, &err);

    while (DEF_TRUE)
    {
      // 깜빡임 효과 (비프 ON)
      Buzzer_On();
      OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err); // 0.3초 ON

      // 깜빡임 효과 (비프 OFF)
      Buzzer_Off();
      OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err); // 0.2초 OFF

      // 알람 OFF 신호가 들어왔는지 체크
      if (OSFlagPend(&AlarmFlagGroup, ALARM_FLAG_OFF, 0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
                     0, &err))
      {
        break;
      }
    }

    // 3. 부저 완전히 종료
    Buzzer_Off();
    static const char msg_off[] = "알람이 해제되었습니다!\r\n\r\n";
    OSQPost(&USARTMsgQ, (void *)msg_off, sizeof(msg_off), OS_OPT_POST_FIFO, &err);
  }
}

// Touch Sensor Task
static void TouchSensorTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  uint8_t prev, curr;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 알람 울림 신호 기다림
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_TOUCH,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 터치센서 OFF될 때까지 대기
    while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3) == Bit_SET)
    {
      OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
    }
    prev = Bit_RESET;

    // 3. 터치 감지(딱 한 번)
    int touched = 0;
    while (!touched)
    {
      curr = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3);
      if (curr == Bit_SET && prev == Bit_RESET)
      {
        static char mission_start[] = "\r\n터치 성공! 미션 시작!\r\n";
        OSQPost(&USARTMsgQ, (void *)mission_start, sizeof(mission_start), OS_OPT_POST_FIFO, &err);
        OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err);

        // 터치된 순간의 초를 캡쳐해 랜덤한 인덱스 생성
        RTC_TimeTypeDef rtc_time;
        RTC_GetTime(RTC_Format_BIN, &rtc_time);
        random_index = rtc_time.RTC_Seconds % 3;

        // MissionTask에 신호
        OSFlagPost(&AlarmFlagGroup,
                   ALARM_FLAG_MISSION,
                   OS_OPT_POST_FLAG_SET,
                   &err);

        touched = 1;
      }
      prev = curr;
      OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
    }

    // 4. 알람이 해제될 때까지 Block (ALARM_FLAG_OFF 대기)
    OSFlagPend(&AlarmFlagGroup,
               ALARM_FLAG_OFF,
               0,
               OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
               0,
               &err);
  }
}

static void MissionTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  void *msg;
  OS_MSG_SIZE msg_size;
  SensorInput input;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 터치 감지될 때까지 대기
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_MISSION,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 미션 랜덤 선택
    int required_button = button_missions[random_index];

    char buf[128];
    snprintf(buf, sizeof(buf),
             "[미션 1]: 버튼 %d회를 누르세요!\r\n", required_button);
    OSQPost(&USARTMsgQ, (void *)buf, strlen(buf) + 1, OS_OPT_POST_FIFO, &err);

    OSFlagPost(&AlarmFlagGroup,
               ALARM_FLAG_BUTTON,
               OS_OPT_POST_FLAG_SET,
               &err);

    int button_cnt = 0;
    int mission_fail = 0;

    while (1)
    {
      // 알람 해제 신호 오면 즉시 종료(예: 외부에서 강제 종료)
      if (OSFlagPend(&AlarmFlagGroup,
                     ALARM_FLAG_OFF,
                     0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
                     0,
                     &err))
      {
        // 강제 종료(성공/실패 상관없이 태스크 종료)
        return;
      }

      msg = OSQPend(&SensorInputQ, 0, OS_OPT_PEND_BLOCKING, &msg_size, 0, &err);
      if (err != OS_ERR_NONE)
        continue;

      input = *(SensorInput *)msg;

      if (input.type == SENSOR_BUTTON)
      {
        button_cnt++;
      }

      if (button_cnt >= required_button)
      {

        OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
        USART_SendString("미션 1 성공!\r\n\r\n[미션 2]: ");

        OSFlagPost(&AlarmFlagGroup,
                   ALARM_FLAG_BUTTON_SUCCESS,
                   OS_OPT_POST_FLAG_SET,
                   &err);
      }
    }
  }
}

// Button Task
static void ButtonTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  uint8_t prev, curr;
  SensorInput input;

  (void)p_arg;

